IDEA Open Model
StagedCheckSection Class
Compatible with IDEA StatiCa 20.1
 Single check section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.CheckSection
 IdeaRS.OpenModel.Concrete.StagedCheckSection
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class StagedCheckSection : CheckSection
Public Class StagedCheckSection
	Inherits CheckSection
The StagedCheckSection type exposes the following members.
Constructors
Name | Description
StagedCheckSection
 Constructor
Top
Properties
Name | Description
Description
 Description of this section
 (Inherited from CheckSection.)
Extremes
 Section extremes
 (Inherited from CheckSection.)
CheckMember
 CheckMember
 (Inherited from CheckSection.)
Id
 Element Id
 (Inherited from OpenElementId.)
ReinfSection
 Reinforcement of cross-section
 (Inherited from CheckSection.)
StagesLoading
 Stages loading
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace